import requests
import json

BASE_URL = "http://127.0.0.1:5000"

# POST запит для додавання підручника до БД
def add_textbook(data):
    response = requests.post(f"{BASE_URL}/add_textbook", json=data)
    if response.status_code == 200:
        print("Add success:", response.json())
    else:
        print(f"Error {response.status_code}: {response.text}")

# GET запит для отримання підручника за ID
def get_textbook_by_id(textbook_id):
    response = requests.get(f"{BASE_URL}/get_textbook_by_id/{textbook_id}")
    if response.status_code == 200:
        textbook = response.json()
        print("Textbook:", json.dumps(textbook, indent=4, ensure_ascii=False))
    else:
        print(f"Error {response.status_code}: {response.text}")

# PUT запит для оновлення підручника
def update_textbook(textbook_id, data):
    response = requests.put(f"{BASE_URL}/update_textbook/{textbook_id}", json=data)
    if response.status_code == 200:
        print("Update Success:", response.json())
    else:
        print(f"Error {response.status_code}: {response.text}")

# DELETE запит для видалення підручника за ID
def delete_textbook(textbook_id):
    response = requests.delete(f"{BASE_URL}/delete_textbook/{textbook_id}")
    if response.status_code == 200:
        print("Delete Success:", response.json())
    else:
        print(f"Error {response.status_code}: {response.text}")

def search_textbooks(query):
    response = requests.get(f"{BASE_URL}/search_textbooks", params={"query": query})
    if response.status_code == 200:
        textbooks = response.json()
        if textbooks:
            print("Search Results:")
            for textbook in textbooks:
                print(json.dumps(textbook, indent=4, ensure_ascii=False))
        else:
            print("No textbooks found")
    else:
        print(f"Error {response.status_code}: {response.text}")

# Приклади використання
if __name__ == "__main__":
    bookies = [("Історія Науки і Техніки",
                "Історія Науки і Техніки",
                "Лебедєв І.К., Ігнатова Л.Р., Махінько А.І.",
                f"""Історія науки і техніки : навч.-метод. матеріали для студ. ф-ту
    прикладної математики ; навч. посіб. для студ. спец. 113 «Прикладна
    математика», 121 «Інженерія програмного забезпечення», 123
    «Комп’ютерна інженерія» / І. К. Лебедєв, Л. Р. Ігнатова, А. І. Махінько;
    КПІ ім. Ігоря Сікорського. – Київ : КПІ ім. Ігоря Сікорського, Вид-во
    «Політехніка», 2021. – 128 с.""",
                "https://www.sendbig.com/view-files/?Id=c2682c98-61b7-33d1-8a3b-8de88acd3099",
                f"D:\oblozhky\pngs_of\ІСТОРІЯ_НАУКИ_ТА_ТЕХНІКИ_(ЛЕБЕДЄВ_ТА_ІНШІ).png"),

               ("Комп'ютерна логіка. Частина 1. Комп'ютерна логіка",
                "Комп'ютерна логіка",
                "В.І. Жабін, О.А. Верба",
                f"""Комп'ютерна логіка. Частина 1. Комп'ютерна логіка. Методичні вказівки
    до виконання лабораторних робіт для здобувачів ступеня бакалавра за
    освітньою програмою  «Комп’ютерні системи та мережі»  спеціальності 123
    Комп’ютерна інженерія денної та заочної форми навчання / Уклад.:
    В.І.Жабін, О.А.Верба. НТУУ «КПІ імені Ігоря Сікорського», 2022. – 79 с.""",
                "https://www.sendbig.com/view-files/?Id=b1fccf16-a7ff-568a-4f36-b42ede77afcc",
                f"D:\oblozhky\pngs_of\КОМП'ЮТЕРНА ЛОГІКА. Ч. 1. КОМП'ЮТЕРНА ЛОГІКА (ЖАБІН та ВЕРБА).png"),

               ("Комп'ютерна логіка. Частина 2. Комп'ютерна арифметика",
                "Комп'ютерна логіка",
                "В.І. Жабін, О.А. Верба",
                f"""Комп’ютерна логіка. Частина 2. Комп’ютерна арифметика. Методичні вказівки
    до виконання лабораторних робіт для здобувачів ступеня бакалавра за
    освітньою програмою  «Комп’ютерні системи та мережі»  спеціальності 123
    Комп’ютерна інженерія денної та заочної форми навчання / Уклад.:
    В.І.Жабін, О.А.Верба. НТУУ «КПІ імені Ігоря Сікорського», 2022. – 77 с.""",
                "https://www.sendbig.com/view-files/?Id=d8a24e45-9b4c-bd34-5cb9-eeba71f5e288",
                f"D:\oblozhky\pngs_of\КОМП'ЮТЕРНА ЛОГІКА. Ч. 2. КОМП'ЮТЕРНА АРИФМЕТИКА (ЖАБІН та ВЕРБА).png"),

               ("Електрика та магнетизм",
                "Фізика",
                "В.Ф. Русаков",
                f"""У посібнику викладено матеріал з електромагнетизму відповідно до програми
    із загальної фізики. Для студентів спеціальностей: «Фізика та астрономія»,
    «Комп’ютерні науки та інформаційні технології», «Кібербезпека», «Метрологія
    та інформаційно-вимірювальні технології», «Прикладна фізика», «Середня
    освіта. Фізика». Може використовуватися студентами й інших спеціальностей
    під час вивчення відповідних розділів курсу загальної фізики.""",
                "https://www.sendbig.com/view-files/?Id=c7dec96d-4bc2-c6a2-fc47-2d99e1e3a202",
                f"D:\oblozhky\pngs_of\ЕЛЕКТРИКА ТА МАГНЕТИЗМ (РУСАКОВ).png"),

               ("Загальна фізика. Механіка",
                "Фізика",
                "В.Ф. Русаков",
                f"""Русаков В. Ф. Загальна фізика. Механіка. [Електронний ресурс]: навчальний
    посібник для здобувачів ступеня бакалавра за освітньою програмою «Комп'ютерне
    моделювання фізичних процесів» спеціальності 104 «Фізика та астрономія» і
    інженерно-технічних спеціальностей вищих навчальних закладів. – Електронні
    текстові данні (1 файл: 820 Kбайт). – Київ: КПІ ім. Ігоря Сікорського, 2022.
    – 149 с.""",
                "https://www.sendbig.com/view-files/?Id=1c6e477b-02c0-4d90-211b-4710ef8ce011",
                f"D:\oblozhky\pngs_of\ЗАГАЛЬНА ФІЗИКА. МЕХАНІКА (РУСАКОВ).png"),

               ("Дискретна математика",
                "Дискретна математика",
                "М.А. Новотарський",
                f"""Навчальний посібник створений за матеріалами лекцій з курсу «Дискретна
    математика». Він містить основні положення теорії множин, комбінаторики та теорії
    графів. Зокрема розглянуті основи теорії множин, відповідностей та відношень на
    множинах. Представлені відношення еквівалентності та порядку, детально описані
    їх властивості. Основні положення комбінаторики представлені законами
    комбінаторики, комбінаторними вибірками та типовими комбінаторними
    алгоритмами. Значна увага приділена теорії графів. Розглянуті базові визначення
    теорії графів, способи створення та властивості графів, відношення та відображення
    на графах, магічні числа графів. Окремо розглянуто дерева, їх властивості та ліс.
    Описані основні алгоритми на графах, призначені для обходу графів, визначення
    найкоротших шляхів у них та побудови мінімальних остовних дерев. Наведені базові
    поняття та теореми, пов’язані з правильним мінімальним розфарбуванням графів.
    Дано код або псевдокод основних алгоритмів розфарбування.
    Посібник може бути корисним для інженерів та студентів технічних спеціальностей.""",
                "https://www.sendbig.com/view-files/?Id=c08be5d1-b847-f121-8097-3cee74558d65",
                f"D:\oblozhky\pngs_of\ДИСКРЕТНА МАТЕМАТИКА (НОВОТАРСЬКИЙ).png"),

               ("Структури даних та алгоритми - 1. Основи алгоритмізації",
                "Струкдури даних та алгоритми",
                "О.І. Марченко",
                f"""Навчальне електронне видання містить завдання до виконання лабораторних робіт
    по кредитному модулю "Структури даних та алгоритми - 1. Основи алгоритмізації"
    Наведені варіанти індивідуальних завдань. До кожної роботи надаються вказівки
    щодо виконання завдань, тестування програм та оформлення звіту, а також наведені
    контрольні питання для підготовки до захисту лабораторних робіт. Призначеня для
    студентів напряму підготовки 6.050102 "Комп'ютерна інженерія". """,
                "https://www.sendbig.com/view-files/?Id=de9a9086-2aab-08fd-fcc4-7c6ce7d3ecc3",
                f"D:\oblozhky\pngs_of\СТРУКТУРИ ДАНИХ ТА АЛГОРИТМИ-1 (МАРЧЕНКО).png"),

               ("Структури даних та алгоритми - 2. Складні структури даних та алгоритми",
                "Струкдури даних та алгоритми",
                "О.І. Марченко",
                f"""Навчальне електронне видання містить завдання до виконання лабораторних робіт
    по кредитному модулю "Структури даних та алгоритми - 2. Складні структури"
    Наведені варіанти індивідуальних завдань. До кожної роботи надаються вказівки
    щодо виконання завдань, тестування програм та оформлення звіту, а також наведені
    контрольні питання для підготовки до захисту лабораторних робіт. Призначеня для
    студентів напряму підготовки 6.050102 "Комп'ютерна інженерія".""",
                "https://www.sendbig.com/view-files/?Id=d95d8136-95e6-6584-7241-abbc7cce9bcc",
                f"D:\oblozhky\pngs_of\СТРУКТУРИ ДАНИХ ТА АЛГОРИТМИ-2 (МАРЧЕНКО).png"),

               ("Прикладна теорія цифрових автоматів",
                "Комп'ютерна логіка. Комп'ютерна Арифметика",
                "В.І. Жабін, І.А. Жуков, І.А. Клименко, В.В. Ткаченко",
                f"""Розглянуто прикладні питання теорії цифрових автоматів, методи аналізу і
    синтезу логічних схем у сучасному елементному базисі, способи подання інформації
    та реалізації арифметичних операцій в ЕОМ. Запропоновано завдання та подано
    рекомендації з організації курсового проектування, лабораторних занять та
    контролю знань в умовах кредитно-модульної системи навчання.
        Для студентів напряму «Комп’ютерна інженерія». Може бути корисний
    для спеціалістів, які працюють у галузі проектування цифрових систем.""",
                "https://www.sendbig.com/view-files/?Id=b2c90d96-ec97-69e3-cb2b-04d95cf0b6b2",
                f"D:\oblozhky\pngs_of\ПРИКЛАДНА ТЕОРІЯ ЦИФРОВИХ АВТОМАТІВ (ЖАБІН ТА ІНШІ).png")]

    keys_1 = ["title", "discipline", "author", "description", "link", "image_path"]
    my_dict = []
    for i in range(len(bookies)):
        my_dict.append(dict(zip(keys_1, bookies[i])))

    # Додати підручник до БД
    #for book in my_dict:
    #    add_textbook(book)

    # Отримати підручник за ID
    #get_textbook_by_id(1)

    # Отримати підручник за запитом
    search_textbooks("Структ")



    # Оновити підручник за ID
    #updated_data = {
    #    "title": "Заголовок new",
    #    "discipline": "Дисципліна new",
    #    "description": "Опис new",
    #    "author": "Автор new",
    #    "download_link": "http://newlink.com",
    #    "image_path": "path/to/image_new.jpg"
    #}
    #update_textbook(1, updated_data)

    # Видалити підручник за ID
    #delete_textbook(1)